Repository: helbetica-com-ar/custom-mortgage-calculator
Catalog: languages/custom-mortgage-calculator-*.po
Languages: es_es

source: Loan Details
es_es: Detalles del Préstamo

source: Property Info
es_es: Información de la Propiedad

source: Personal Details
es_es: Datos Personales

source: Get Your Mortgage Estimate
es_es: Obtené tu Estimación Hipotecaria

source: Start your home buying journey with a personalized loan simulation
es_es: Comenzá tu camino hacia la casa propia con una simulación personalizada de préstamo

source: No commitment required
es_es: Sin compromiso requerido

source: Instant calculations
es_es: Cálculos instantáneos

source: Multiple lender options
es_es: Múltiples opciones de prestamistas

source: Secure & Confidential
es_es: Seguro y Confidencial

source: Loan Amount
es_es: Monto del Préstamo

source: Amount you wish to borrow
es_es: Monto que deseás solicitar

source: Loan Term
es_es: Plazo del Préstamo

source: Select term
es_es: Seleccioná el plazo

source: 5 years
es_es: 5 años

source: 10 years
es_es: 10 años

source: 15 years
es_es: 15 años

source: 20 years
es_es: 20 años

source: 25 years
es_es: 25 años

source: 30 years
es_es: 30 años

source: How long to repay the loan
es_es: Tiempo para devolver el préstamo

source: Get Initial Estimate
es_es: Obtener Estimación Inicial

source: Your Estimated Monthly Payment
es_es: Tu Cuota Mensual Estimada

source: /month
es_es: /mes

source: Principal & Interest:
es_es: Capital e Intereses:

source: Est. Property Tax:
es_es: Impuesto a la Propiedad Est.:

source: Est. Insurance:
es_es: Seguro Estimado:

source: *This is a preliminary estimate. More accurate calculations will be provided in the next step.
es_es: *Esta es una estimación preliminar. Los cálculos más precisos se proporcionarán en el siguiente paso.

source: Home Value
es_es: Valor de la Vivienda

source: Estimated market value of the property
es_es: Valor de mercado estimado de la propiedad

source: Down Payment
es_es: Pago Inicial

source: Amount you'll pay upfront
es_es: Monto que pagarás por adelantado

source: Property Location
es_es: Ubicación de la Propiedad

source: City, State
es_es: Ciudad, Provincia

source: Location affects tax rates and insurance
es_es: La ubicación afecta las tasas de impuestos y seguros

source: Previous
es_es: Anterior

source: Get Detailed Estimate
es_es: Obtener Estimación Detallada

source: Your Personalized Loan Estimate
es_es: Tu Estimación Personalizada de Préstamo

source: First Payment Value
es_es: Valor de la Primera Cuota

source: Payment Breakdown
es_es: Desglose de la Cuota

source: Property Tax:
es_es: Impuesto a la Propiedad:

source: Home Insurance:
es_es: Seguro de Vivienda:

source: PMI (if applicable):
es_es: Seguro Hipotecario (si aplica):

source: Loan Amount:
es_es: Monto del Préstamo:

source: Interest Rate:
es_es: Tasa de Interés:

source: Total Interest:
es_es: Intereses Totales:

source: Get Connected with Lenders
es_es: Conectate con Prestamistas

source: Complete your profile to receive personalized offers from our partner lenders.
es_es: Completá tu perfil para recibir ofertas personalizadas de nuestros prestamistas asociados.

source: Full Name
es_es: Nombre Completo

source: John Doe
es_es: Juan Pérez

source: Email Address
es_es: Dirección de Email

source: john@example.com
es_es: juan@ejemplo.com

source: Phone Number
es_es: Número de Teléfono

source: Monthly Income
es_es: Ingresos Mensuales

source: I agree to the %s and %s
es_es: Acepto los %s y la %s

source: Terms of Service
es_es: Términos de Servicio

source: Privacy Policy
es_es: Política de Privacidad

source: I consent to receive marketing communications about loan products
es_es: Acepto recibir comunicaciones de marketing sobre productos de préstamos

source: Get My Loan Offers
es_es: Obtener Mis Ofertas de Préstamo

source: Calculating your personalized estimate...
es_es: Calculando tu estimación personalizada...

source: Thank You!
es_es: ¡Gracias!

source: Your loan application has been submitted successfully. Our partner lenders will contact you within 24 hours with personalized offers.
es_es: Tu solicitud de préstamo se envió exitosamente. Nuestros prestamistas asociados te contactarán dentro de las 24 horas con ofertas personalizadas.

source: What happens next?
es_es: ¿Qué sigue ahora?

source: Review of your application by multiple lenders
es_es: Revisión de tu solicitud por múltiples prestamistas

source: Personalized loan offers sent to your email
es_es: Ofertas personalizadas de préstamo enviadas a tu email

source: Direct contact from qualified loan officers
es_es: Contacto directo de oficiales de préstamo calificados

source: Security check failed
es_es: Falló la verificación de seguridad

source: Step data saved successfully
es_es: Datos del paso guardados exitosamente

source: Application submitted successfully
es_es: Solicitud enviada exitosamente

source: Your Mortgage Application - Confirmation #
es_es: Tu Solicitud Hipotecaria - Confirmación #

source: New Mortgage Application Received - #
es_es: Nueva Solicitud Hipotecaria Recibida - #

source: Thank You for Your Mortgage Application!
es_es: ¡Gracias por tu Solicitud Hipotecaria!

source: Dear
es_es: Estimado/a

source: We've received your mortgage application (Confirmation #
es_es: Hemos recibido tu solicitud hipotecaria (Confirmación #

source: ) and our partner lenders will review it shortly.
es_es: ) y nuestros prestamistas asociados la revisarán en breve.

source: Application Summary:
es_es: Resumen de la Solicitud:

source: Our partner lenders will review your application within 24 hours
es_es: Nuestros prestamistas asociados revisarán tu solicitud dentro de las 24 horas

source: You'll receive personalized loan offers via email
es_es: Recibirás ofertas personalizadas de préstamo por email

source: A qualified loan officer will contact you to discuss your options
es_es: Un oficial de préstamo calificado te contactará para discutir tus opciones

source: If you have any questions, please don't hesitate to contact us.
es_es: Si tenés alguna pregunta, no dudes en contactarnos.

source: Best regards,
es_es: Saludos cordiales,

source: The Mortgage Team
es_es: El Equipo Hipotecario

source: New Mortgage Application Received
es_es: Nueva Solicitud Hipotecaria Recibida

source: Submission ID:
es_es: ID de Envío:

source: Submission Date:
es_es: Fecha de Envío:

source: Applicant Information:
es_es: Información del Solicitante:

source: Name:
es_es: Nombre:

source: Phone:
es_es: Teléfono:

source: years
es_es: años

source: Consent Information:
es_es: Información de Consentimiento:

source: Terms Accepted:
es_es: Términos Aceptados:

source: Marketing Consent:
es_es: Consentimiento de Marketing:

source: Yes
es_es: Sí

source: We've received your mortgage application (Confirmation #%s) and our partner lenders will review it shortly.
es_es: Hemos recibido tu solicitud hipotecaria (Confirmación #%s) y nuestros prestamistas asociados la revisarán en breve.

source: Property Value:
es_es: Valor de la Propiedad:

source: Tell Us About Your Loan
es_es: Contanos Sobre Tu Préstamo

source: Provide basic information to get started with your mortgage estimate.
es_es: Proporcioná información básica para comenzar con tu estimación hipotecaria.

source: Property & Financial Information
es_es: Información de la Propiedad y Financiera

source: Help us refine your estimate with property details and income.
es_es: Ayudanos a refinar tu estimación con detalles de la propiedad e ingresos.

source: Loan Term:
es_es: Plazo del Préstamo:

source: Your gross monthly income
es_es: Tu ingreso mensual bruto

source: Property Value
es_es: Valor de la Propiedad

source: Property Use
es_es: Uso de la Propiedad

source: Select property use
es_es: Seleccioná el uso de la propiedad

source: Primary Residence
es_es: Residencia Principal

source: Second Home
es_es: Segunda Vivienda

source: Investment
es_es: Inversión

source: How you plan to use the property
es_es: Cómo planeás usar la propiedad

source: Debt-to-Income Ratio:
es_es: Relación Deuda-Ingreso:

source: Preferred Contact Method
es_es: Método de Contacto Preferido

source: Phone
es_es: Teléfono

source: Select your preferred contact method(s)
es_es: Seleccioná tu(s) método(s) de contacto preferido(s)

source: Get Your UVA Mortgage Estimate
es_es: Obtené tu Estimación de Crédito UVA

source: Simulate your UVA mortgage with current market values
es_es: Simulá tu crédito UVA con valores actuales del mercado

source: Value of Your First UVA Payment
es_es: Valor de tu Primera Cuota UVA

source: UVA value today:
es_es: Valor UVA hoy:

source: Using cached value
es_es: Usando valor en caché

source: Updated %s hours ago
es_es: Actualizado hace %s horas

source: Updated at
es_es: Actualizado
